/*****************************************************************************
 *
 * 
 * Copyright 2016 - 2019 CHENGDU HAIGUANG IC DESIGN CO., LTD. All Rights Reserved.
 * 
 * HYGON is granting you permission to use this software (the Materials)
 * pursuant to the terms and conditions of your Software License Agreement
 * with HYGON.  This header does *NOT* give you permission to use the Materials
 * or any rights under HYGON's intellectual property.  Your use of any portion
 * of these Materials shall constitute your acceptance of those terms and
 * conditions.  If you do not agree to the terms and conditions of the Software
 * License Agreement, please do not use any portion of these Materials.
 * 
 * CONFIDENTIALITY:  The Materials and all other information, identified as
 * confidential and provided to you by HYGON shall be kept confidential in
 * accordance with the terms and conditions of the Software License Agreement.
 * 
 * LIMITATION OF LIABILITY: THE MATERIALS AND ANY OTHER RELATED INFORMATION
 * PROVIDED TO YOU BY HYGON ARE PROVIDED "AS IS" WITHOUT ANY EXPRESS OR IMPLIED
 * WARRANTY OF ANY KIND, INCLUDING BUT NOT LIMITED TO WARRANTIES OF
 * MERCHANTABILITY, NONINFRINGEMENT, TITLE, FITNESS FOR ANY PARTICULAR PURPOSE,
 * OR WARRANTIES ARISING FROM CONDUCT, COURSE OF DEALING, OR USAGE OF TRADE.
 * IN NO EVENT SHALL HYGON OR ITS LICENSORS BE LIABLE FOR ANY DAMAGES WHATSOEVER
 * (INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS, BUSINESS

#define RAS_GLOBAL_STATUS_LO_MASK           (0x000000FF)
#define RAS_GLOBAL_STATUS_HI_MASK           (0x0003FFFF)
#define PCIE0_UNCORR_ERR_STATUS             (0x11100154)
#define PCIE1_UNCORR_ERR_STATUS             (0x11200154)

#define PARITY_ERROR_STATUS_UNCORR_GRP      (0x13B20028)
#define PARITY_ERROR_STATUS_CORR_GRP        (0x13B20068)
#define PARITY_COUNTER_CORR_GRP             (0x13B200B0)
#define PARITY_ERROR_STATUS_UCP_GRP         (0x13B200F8)
#define PARITY_COUNTER_UCP_GRP              (0x13B20128)
#define PCIE_PORT_ACTION_CONTROL_BASE       (0x13B2017C)
#define PCIE_ACTION_CONTROL_OFFSET          (0x20)
#define NBIF0_ACTION_CONTROL_BASE           (0x13B2037C)
#define NBIF1_ACTION_CONTROL_BASE           (0x13B2039C)

#define NBIF_GDC_RAS_LEAF0_CTRL             (0x0141F800)
#define NBIF_BIF_RAS_LEAF0_CTRL             (0x10139000)


#define MAX_UNCORR_GRP_NUM                  (16)
#define MAX_CORR_GRP_NUM                    (18)
#define MAX_UCP_GRP_NUM                     (12)

// PMIO BreakEvent Register for SMN errors
#define PMIO_SMN_BREAK_EVENT                (0x02D01380)

#define SMN_CATEGORY_SMN_PARITY_TIMEOUT_PSP_SMU_PARITY_ECC (1 << 0)
#define SMN_CATEGORY_PSP_PARITY_ECC         (1 << 2)
#define SMN_CATEGORY_SMN_TIMEOUT_SMU        (1 << 3)
#define SMN_CATEGORY_SMN_LINK_PACKET_CRC_WITH_RETRY (1 << 4)
#define SMN_CATEGORY_MASK                   (SMN_CATEGORY_SMN_PARITY_TIMEOUT_PSP_SMU_PARITY_ECC | SMN_CATEGORY_PSP_PARITY_ECC | SMN_CATEGORY_SMN_TIMEOUT_SMU | SMN_CATEGORY_SMN_LINK_PACKET_CRC_WITH_RETRY)

//FCH
#define FCH_SMN_SATA_CONTROL_BAR5           (0x03101000ul)
#define FCH_SMN_SATA_CONTROL_SLOR           (0x03101800ul)
#define FCH_SATA_BAR5_REG110                (0x0110)
#define FCH_SATA_BAR5_REG130                (0x0130)

#define TAISHAN_SATA_PORT_NUM               (8)

#define SATA_PAR_ERR_CNXT_STS               (BIT10)
#define SATA_PAR_ERR_H2D_STS                (BIT9)
#define SATA_PAR_ERR_D2H2D_STS              (BIT8)
#define SATA_PAR_ERR_STS                    (SATA_PAR_ERR_CNXT_STS + SATA_PAR_ERR_H2D_STS + SATA_PAR_ERR_D2H2D_STS)

//UMC
#define UMC0_CH_REG_BASE                    (0x00050000)
#define UMC1_CH_REG_BASE                    (0x00150000)
#define UMC_ECC_CTRL                        (0x0000014C)
#define UMC_MISC_CFG                        (0x000001E0)
#define UMC_ECC_ERR_INJ_CTRL                (0x00000D88)
  #define ECC_ERR_ADDR_EN                   (BIT2)
#define UMC_ECC_ERR_INJ                     (0x00000DB0)

//DF
#define DF_DFF6_REG_BASE                    (0x0001D800)
#define DRAM_SCRUBBER_ERRORADDR_LO          (0x00000040)
  #define ERR_INJ_EN                        (BIT0)
#define DRAM_SCRUBBER_ERRORADDR_HI          (0x00000044)
#define DRAM_SCRUBBER_BASEADDR_REG          (0x00000048)
#define DRAM_SCRUBBER_LIMIT_ADDR            (0x0000004C)  //DramScrubLimitAddr
#define DRAM_SCRUBBER_ADDR_LO               (0x00000050)  //DramScrubAddrLo
#define DRAM_SCRUBBER_ADDR_HI               (0x00000054)  //DramScrubAddrHi

//NBIO

//Structure

typedef struct _SMM_SAVE_STATE {
   UINT64   ES[2];                           //FE00
   UINT64   CS[2];                           //FE10
   UINT64   SS[2];                           //FE20
   UINT64   DS[2];                           //FE30
   UINT64   FS[2];                           //FE40
   UINT64   GS[2];                           //FE50
   UINT64   GDTR[2];                         //FE60
   UINT64   LDTR[2];                         //FE70
   UINT64   IDTR[2];                         //FE80
   UINT64   TR[2];                           //FE90
   UINT64   IO_RESTAERT_RIP;                 //FEA0
   UINT64   IO_RESTAERT_RCX;                 //FEA8
   UINT64   IO_RESTAERT_RSI;                 //FEB0
   UINT64   IO_RESTAERT_RDI;                 //FEB8
   UINT32   TrapoFFSET;                      //FEC0
   UINT32   LocalSmiStatus;                  //FEC4
   UINT8    IoRestart;                       //FEC8
   UINT8    AutoHalt;                        //FEC9
   UINT8    NmiMask;                         //FECA
   UINT8    Reserved1[5];                    //FECB
   UINT64   EFER;                            //FED0
   UINT64   SvmState;                        //FED8
   UINT64   GuestVMCBPyysicalAddress;        //FEE0
   UINT64   SVMVirtualInterruptControl;      //FEE8
   UINT8    Reserved2[12];                   //FEF0
   UINT32   SMMRevId;                        //FEFC
   UINT32   SMBASE;                          //FF00
   UINT8    Reserved3[28];                   //FF04
   UINT64   GuestPAT;                        //FF20
   UINT64   HostEFER;                        //FF28
   UINT64   HostCR4;                         //FF30
   UINT64   NestedCR3;                       //FF38
   UINT64   HostCR0;                         //FF40
   UINT64   CR4;                             //FF48
   UINT64   CR3;                             //FF50
   UINT64   CR0;                             //FF58
   UINT64   DR7;                             //FF60
   UINT64   DR6;                             //FF68
   UINT64   RFLAGS;                          //FF70
   UINT64   RIP;                             //FF78
   UINT64   R15;                             //FF80
   UINT64   R14;                             //FF88
   UINT64   R13;                             //FF90
   UINT64   R12;                             //FF98
   UINT64   R11;                             //FFA0
   UINT64   R10;                             //FFA8
   UINT64   R9;                              //FFB0
   UINT64   R8;                              //FFB8
   UINT64   RDI;                             //FFC0
   UINT64   RSI;                             //FFC8
   UINT64   RBP;                             //FFD0
   UINT64   RSP;                             //FFD8
   UINT64   RBX;                             //FFE0
   UINT64   RDX;                             //FFE8
   UINT64   RCX;                             //FFF0
   UINT64   RAX;                             //FFF8
} SMM_SAVE_STATE;

/// RAS MCA Bank enumerate
typedef enum _AMD_MCA_BANK_NUM {
//CORE MCA Banks, access through each thread.
  MCA_LS_BANK = 0,        ///< / 0  = MCA LS
  MCA_IF_BANK,            ///< / 1  = MCA IF
  MCA_L2_BANK,            ///< / 2  = MCA L2
  MCA_DE_BANK,            ///< / 3  = MCA DE
  MCA_EMPTY0_BANK,        ///< / 4  = EMPTY BANK
  MCA_EX_BANK,            ///< / 5  = MCA EX
  MCA_FP_BANK,            ///< / 6  = MCA FP

//NON-CORE MCA banks, access from logic core 0 from each Die

//MCA L3 CCXx SLIDEx Bank number define
  MCA_L3_C0_S0_BANK,      ///< / 7  = MCA L3 CCX 0 SLIDE 0
  MCA_L3_C0_S1_BANK,      ///< / 8  = MCA L3 CCX 0 SLIDE 1
  MCA_L3_C0_S2_BANK,      ///< / 9  = MCA L3 CCX 0 SLIDE 2
  MCA_L3_C0_S3_BANK,      ///< / 10  = MCA L3 CCX 0 SLIDE 3
  MCA_L3_C1_S0_BANK,      ///< / 11  = MCA L3 CCX 1 SLIDE 0
  MCA_L3_C1_S1_BANK,      ///< / 12  = MCA L3 CCX 1 SLIDE 1
